import AboutSectionOne from "@/components/About/AboutSectionOne";
import AboutSectionTwo from "@/components/About/AboutSectionTwo";
import Breadcrumb from "@/components/Common/Breadcrumb";

import { Metadata } from "next";

export const metadata: Metadata = {
  title: "درباره ما ",
  description: "This is About Page for Pishkar | Your personal smart mobile valet",
  // other metadata
};

const AboutPage = () => {
  return (
    <>
      <Breadcrumb
        pageName="درباره ما"
        //         description={`پیشکار از سال ۱۴۰۴ با یک دغدغه‌ ساده اما عمیق متولد شد: اینکه چرا انجام کارهای روزمره هنوز این‌قدر زمان‌بر، پراکنده و فرساینده است؟ ما باور داریم هر فرد باید یک «پیشکار دیجیتال» در کنار خود داشته باشد؛ دستیاری هوشمند، قابل اعتماد و شخصی‌سازی‌شده که نه‌تنها دستورات را اجرا کند، بلکه رفتار کاربر را بفهمد، اولویت‌ها را بشناسد و فعالانه در مدیریت زندگی روزمره او نقش داشته باشد.\n
        // پیشکار با ترکیب هوش مصنوعی پیشرفته، اتوماسیون نرم‌افزاری و طراحی محصول کاربرمحور، وظایفی مانند پرداخت قبوض، مدیریت ارتباطات، یادآوری اطلاعات شخصی، تکمیل فرم‌ها، تولید و ارسال اسناد (ایمیل، نامه و ...)، زمان‌بندی، یادآوری‌های هوشمند و سایر عملیات روزانه را به شکلی یکپارچه و خودکار انجام می‌دهد.\n
        //  هدف ما تنها انجام کارها نیست؛ بلکه بازگرداندن زمان، تمرکز و آرامش ذهنی به کاربران است.`}

        description={` پیشکار از سال ۱۴۰۴ با یک دغدغه ساده اما عمیق شکل گرفت: چرا تعامل کاربران با کسب‌وکارها هنوز تا حد زیادی به مسیرهای از پیش‌تعریف‌شده، فرم‌ها و رابط‌های سنتی وابسته است؟ ما باور داریم نسل جدید تجربه دیجیتال باید به‌جای وادار کردن کاربر به پیدا کردن مسیر، بتواند هدف او را بفهمد و مسیر انجام آن را بر عهده بگیرد.
پیشکار یک لایه هوشمند برای کسب‌وکارهاست که با استفاده از هوش مصنوعی، زبان طبیعی را به اقدام واقعی تبدیل می‌کند؛ به زیرساخت‌ها و سرویس‌های موجود متصل می‌شود، فرآیندهای کسب‌وکار را درک می‌کند و اجرای آن‌ها را در تعامل با کاربر بر عهده می‌گیرد.
هدف ما ساختن تجربه‌ای است که در آن کاربر به‌جای جست‌وجو در میان امکانات یک پلتفرم، کافی است نیاز خود را بیان کند؛ و کسب‌وکار نیز بدون بازطراحی زیرساخت خود، بتواند خدمات و فرآیندهایش را هوشمندتر، در دسترس‌تر و نتیجه‌محورتر ارائه کند.
          `}
      />
      <AboutSectionOne />
      <AboutSectionTwo />
    </>
  );
};

export default AboutPage;
