import random

from app.chat.models.models import GraphState
from app.chat.logger import get_logger

logger = get_logger("greeting")

# _GREETING_MESSAGES = [
#     "سلام! خوش اومدی. امروز دوست داری کمکت کنم با چی کار کنی؟",
#     "سلام ! من پیشکار هستم. بگو از کجا شروع کنیم؟",
#     "سلام بر تو! خوشحالم که پیام دادی. چه کاری برات انجام بدم؟",
#     "سلام! آماده‌ام کمکت کنم. نوبت پزشکی، استعلام، یا هر چیز دیگه‌ای مدنظرته؟",
#     "درود بر شما! خوش اومدی به پیشکار. چطور می‌تونم کمکت کنم؟",
#     "سلام! خوبی؟ اگر کاری داری بگو تا باهم انجامش بدیم.",
#     "سلام عزیز! من اینجام تا کمکت کنم. دوست داری از چی شروع کنیم؟",
#     "سلام! من پیشکارم و کنارت هستم. بگو چی لازم داری.",
#     "سلام! آماده‌ام هر سوال یا درخواستی داری جواب بدم.",
# ]

_GREETING_MESSAGES = [
    "سلام! به سامانه حوزه‌های علمیه خواهران خوش اومدی 🌱 چطور می‌تونم کمکت کنم؟",
    "سلام و خوش اومدی 🌸 من دستیار هوشمند حوزه‌های علمیه خواهران هستم. چه کمکی از دستم برمیاد؟",
    "سلام! به حوزه‌های علمیه خواهران خوش اومدی. بگو ببینم چطور می‌تونم راهنماییت کنم؟",
    "سلام و درود 🌷 در خدمتت هستم. چه اطلاعاتی درباره حوزه‌های علمیه خواهران می‌خوای؟",
    "سلام! خوشحالم که به سامانه حوزه‌های علمیه خواهران سر زدی. چطور می‌تونم راهنماییت کنم؟",
    "سلام و خوش آمدید 🌱 من دستیار هوشمند حوزه‌های علمیه خواهران هستم. بفرمایید چه کمکی می‌خواهید؟",
    "سلام! اگر درباره حوزه‌های علمیه خواهران، پذیرش، مدارس یا برنامه‌ها سوالی داری، بپرس.",
    "سلام و خوش اومدی 🌸 هر سوالی درباره حوزه‌های علمیه خواهران داری، من در خدمتم.",
    "سلام! به سامانه هوشمند حوزه‌های علمیه خواهران خوش آمدید. چگونه می‌توانم کمکتان کنم؟",
]


def greeting_node(state: GraphState, llm=None) -> GraphState:
    state.final_response = random.choice(_GREETING_MESSAGES)
    logger.info(f"Greeting response: {state.final_response}")
    return state
